#+TODO: BROKEN CHECK TODO

#+title: .emacs configuration

Документация по организации этого конфига лежит [[https://www.emacswiki.org/emacs/OrgDotemacs#searchlang][тут]].

** Agenda
:PROPERTIES:
:NAME: agenda
:DEPENDS: orgmode
:END:
#+BEGIN_SRC emacs-lisp
(setq org-agenda-window-setup 'current-window)
(setq org-agenda-span 'day)
(setq org-agenda-start-with-log-mode t)

;; Make done tasks show up in the agenda log
(setq org-log-done 'time)
(setq org-log-into-drawer t)

(setq org-columns-default-format "%20CATEGORY(Category) %65ITEM(Task) %TODO %6Effort(Estim){:}  %6CLOCKSUM(Clock) %TAGS")

(defun get-month-tag ()
  (let ((month (format-time-string "%B")))
  (concat "@" month)))

(setq org-agenda-custom-commands
      `(("d" "Dashboard"
         ((agenda "" ((org-deadline-warning-days 7)))
	  (tags-todo (concat "@tmsg:" (get-month-tag)) ((org-agenda-overriding-header "TMsg")))
	  (tags-todo (concat "@twork:" (get-month-tag)) ((org-agenda-overriding-header "TWork")))
	  (tags-todo (concat "@derevyanko:" (get-month-tag)) ((org-agenda-overriding-header "Derevyanko")))
	  (tags-todo (concat "@self_service:" (get-month-tag)) ((org-agenda-overriding-header "Self Service")))
	  (tags-todo (concat (get-month-tag) "-@tmsg-@twork-@derevyanko-@self_service") ((org-agenda-overriding-header "Other")))			  
          (todo "TODO"
                ((org-agenda-overriding-header "Unprocessed Inbox Tasks")
;;                 (org-agenda-files '(,("~/work/wiki" "~/work/Inbox.org" "~/tmsg" "~/twork")))
                 (org-agenda-text-search-extra-files nil)))))

        ("n" "Next Tasks"
         ((agenda "" ((org-deadline-warning-days 7)))
          (todo "NEXT"
                ((org-agenda-overriding-header "Next Tasks")))))

        ;; Low-effort next actions
        ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
         ((org-agenda-overriding-header "Low Effort Tasks")
          (org-agenda-max-todos 20)
          (org-agenda-files org-agenda-files)))))
#+END_SRC

#+RESULTS:
| d | Dashboard  | ((agenda  ((org-deadline-warning-days 7))) (tags-todo (concat @tmsg: (get-month-tag)) ((org-agenda-overriding-header TMsg))) (tags-todo (concat @twork: (get-month-tag)) ((org-agenda-overriding-header TWork))) (tags-todo (concat @derevyanko: (get-month-tag)) ((org-agenda-overriding-header Derevyanko))) (tags-todo (concat @self_service: (get-month-tag)) ((org-agenda-overriding-header Self Service))) (tags-todo (concat (get-month-tag) -@tmsg-@twork-@derevyanko-@self_service) ((org-agenda-overriding-header Other))) (todo TODO ((org-agenda-overriding-header Unprocessed Inbox Tasks) (org-agenda-text-search-extra-files nil)))) |                                                                                                                 |
| n | Next Tasks | ((agenda  ((org-deadline-warning-days 7))) (todo NEXT ((org-agenda-overriding-header Next Tasks))))                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 |                                                                                                                 |
| e | tags-todo  | +TODO="NEXT"+Effort<15&+Effort>0                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    | ((org-agenda-overriding-header Low Effort Tasks) (org-agenda-max-todos 20) (org-agenda-files org-agenda-files)) |
** Capture Templates
:PROPERTIES:
:NAME: templates
:DEPENDS: orgmode
:END:
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c c") 'org-capture)
(defun dw/get-todays-journal-file-name ()
  "Gets the journal file name for today's date"
  (interactive)
  (let* ((journal-file-name
          (expand-file-name
           (format-time-string "%Y/%Y-%2m-%B.org")
           "~/work/Journal/"))
         (journal-year-dir (file-name-directory journal-file-name)))
    (if (not (file-directory-p journal-year-dir))
        (make-directory journal-year-dir))
    journal-file-name))

(defun dw/on-org-capture ()
  ;; Don't show the confirmation header text
  (setq header-line-format nil)

  ;; Control how some buffers are handled
  (let ((template (org-capture-get :key t)))
    (pcase template
      ("jj" (delete-other-windows)))))

(add-hook 'org-capture-mode-hook 'dw/on-org-capture)

(setq org-capture-templates
      `(("t" "Tasks")
	("tt" "Task" entry (file ,"~/work/Inbox.org")
         "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)
	("ts" "Clocked Entry Subtask" entry (clock)
         "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

	("j" "Journal Entries")
	("je" "General Entry" entry
         (file+olp+datetree ,"~/work/Journal.org")
         "\n* %<%I:%M %p> - %^{Title} \n\n%?\n\n"
         :tree-type week
         :clock-in :clock-resume
         :empty-lines 1)
	("jt" "Task Entry" entry
         (file+olp+datetree ,"~/work/Journal.org")
         "\n* %<%I:%M %p> - Task Notes: %a\n\n%?\n\n"
         :tree-type week
         :clock-in :clock-resume
         :empty-lines 1)
	("#" "used by gnus-icalendar-org" entry
	 (file+olp "~/work/calendar.org" "Calendar")
	 "%i" :immediate-finish t)
	("jj" "Journal" entry
         (file+olp+datetree ,"~/work/Journal.org")
         "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
         :tree-type week
         :clock-in :clock-resume
         :empty-lines 1)))
#+END_SRC

#+RESULTS:
| t  | Tasks |       |                         |           |
| tt | Task  | entry | (file ~/work/Inbox.org) | * TODO %? |

